{
  "metadata": {
    "total_size": 71903645408.0
  },
  "weight_map": {
    "lm_head.weight": "model-00026-of-00026.safetensors",
    "model.language_model.embed_tokens.weight": "model-00001-of-00026.safetensors",
    "model.language_model.layers.0.input_layernorm.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.0.linear_attn.A_log": "model-00002-of-00026.safetensors",
    "model.language_model.layers.0.linear_attn.conv1d.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.0.linear_attn.dt_bias": "model-00002-of-00026.safetensors",
    "model.language_model.layers.0.linear_attn.in_proj_a.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.0.linear_attn.in_proj_b.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.0.linear_attn.in_proj_qkv.weight": "model-00001-of-00026.safetensors",
    "model.language_model.layers.0.linear_attn.in_proj_z.weight": "model-00001-of-00026.safetensors",
    "model.language_model.layers.0.linear_attn.norm.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.0.linear_attn.out_proj.weight": "model-00001-of-00026.safetensors",
    "model.language_model.layers.0.mlp.experts.down_proj": "model-00002-of-00026.safetensors",
    "model.language_model.layers.0.mlp.experts.gate_up_proj": "model-00001-of-00026.safetensors",
    "model.language_model.layers.0.mlp.gate.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.0.mlp.shared_expert.down_proj.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.0.mlp.shared_expert.gate_proj.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.0.mlp.shared_expert.up_proj.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.0.mlp.shared_expert_gate.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.0.post_attention_layernorm.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.1.input_layernorm.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.1.linear_attn.A_log": "model-00002-of-00026.safetensors",
    "model.language_model.layers.1.linear_attn.conv1d.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.1.linear_attn.dt_bias": "model-00002-of-00026.safetensors",
    "model.language_model.layers.1.linear_attn.in_proj_a.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.1.linear_attn.in_proj_b.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.1.linear_attn.in_proj_qkv.weight": "model-00001-of-00026.safetensors",
    "model.language_model.layers.1.linear_attn.in_proj_z.weight": "model-00001-of-00026.safetensors",
    "model.language_model.layers.1.linear_attn.norm.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.1.linear_attn.out_proj.weight": "model-00001-of-00026.safetensors",
    "model.language_model.layers.1.mlp.experts.down_proj": "model-00001-of-00026.safetensors",
    "model.language_model.layers.1.mlp.experts.gate_up_proj": "model-00001-of-00026.safetensors",
    "model.language_model.layers.1.mlp.gate.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.1.mlp.shared_expert.down_proj.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.1.mlp.shared_expert.gate_proj.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.1.mlp.shared_expert.up_proj.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.1.mlp.shared_expert_gate.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.1.post_attention_layernorm.weight": "model-00002-of-00026.safetensors",
    "model.language_model.layers.10.input_layernorm.weight": "model-00007-of-00026.safetensors",
    "model.language_model.layers.10.linear_attn.A_log": "model-00007-of-00026.safetensors",
    "model.language_model.layers.10.linear_attn.conv1d.weight": "model-00007-of-00026.safetensors",
    "model.language_model.layers.10.linear_attn.dt_bias": "model-00007-of-00026.safetensors",
    "model.language_model.layers.10.linear_attn.in_proj_a.weight": "model-00007-of-00026.safetensors",
    "model.language_model.layers.10.linear_attn.in_proj_b.weight": "model-00007-of-00026.safetensors",
    "model.language_model.layers.10.linear_attn.in_proj_qkv.weight": "model-00006-of-00026.safetensors",
    "model.language_model.layers.10.linear_attn.in_proj_z.weight": "model-00006-of-00026.safetensors",
    "model.language_model.layers.10.linear_attn.norm.weight": "model-00007-of-00026.safetensors",
    "model.language_model.layers.10.linear_attn.out_proj.weight": "model-00006-of-00026.safetensors",
    "model.language_model.layers.10.mlp.experts.down_proj": "model-00006-of-00026.safetensors",
    "model.language_model.layers.10.mlp.experts.gate_up_proj": "model-00007-of-00026.safetensors",
    "model.language_model.layers.10.mlp.gate.weight": "model-00007-of-00026.safetensors",
    "model.language_model.layers.10.mlp.shared_expert.down_proj.weight": "model-00007-of-00026.safetensors",
    "model.language_model.layers.10.mlp.shared_expert.gate_proj.weight": "model-00007-of-00026.safetensors",
    "model.language_model.layers.10.mlp.shared_expert.up_proj.weight": "model-00007-of-00026.safetensors",
    "model.language_model.layers.10.mlp.shared_expert_gate.weight": "model-00007-of-00026.safetensors",
    "model.language_model.layers.10.post_attention_layernorm.weight": "model-00007-of-00026.safetensors",
    "model.language_model.layers.11.input_layernorm.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.11.mlp.experts.down_proj": "model-00009-of-00026.safetensors",
    "model.language_model.layers.11.mlp.experts.gate_up_proj": "model-00008-of-00026.safetensors",
    "model.language_model.layers.11.mlp.gate.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.11.mlp.shared_expert.down_proj.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.11.mlp.shared_expert.gate_proj.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.11.mlp.shared_expert.up_proj.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.11.mlp.shared_expert_gate.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.11.post_attention_layernorm.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.11.self_attn.k_norm.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.11.self_attn.k_proj.weight": "model-00008-of-00026.safetensors",
    "model.language_model.layers.11.self_attn.o_proj.weight": "model-00008-of-00026.safetensors",
    "model.language_model.layers.11.self_attn.q_norm.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.11.self_attn.q_proj.weight": "model-00008-of-00026.safetensors",
    "model.language_model.layers.11.self_attn.v_proj.weight": "model-00008-of-00026.safetensors",
    "model.language_model.layers.12.input_layernorm.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.12.linear_attn.A_log": "model-00009-of-00026.safetensors",
    "model.language_model.layers.12.linear_attn.conv1d.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.12.linear_attn.dt_bias": "model-00009-of-00026.safetensors",
    "model.language_model.layers.12.linear_attn.in_proj_a.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.12.linear_attn.in_proj_b.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.12.linear_attn.in_proj_qkv.weight": "model-00008-of-00026.safetensors",
    "model.language_model.layers.12.linear_attn.in_proj_z.weight": "model-00008-of-00026.safetensors",
    "model.language_model.layers.12.linear_attn.norm.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.12.linear_attn.out_proj.weight": "model-00008-of-00026.safetensors",
    "model.language_model.layers.12.mlp.experts.down_proj": "model-00009-of-00026.safetensors",
    "model.language_model.layers.12.mlp.experts.gate_up_proj": "model-00008-of-00026.safetensors",
    "model.language_model.layers.12.mlp.gate.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.12.mlp.shared_expert.down_proj.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.12.mlp.shared_expert.gate_proj.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.12.mlp.shared_expert.up_proj.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.12.mlp.shared_expert_gate.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.12.post_attention_layernorm.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.13.input_layernorm.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.13.linear_attn.A_log": "model-00009-of-00026.safetensors",
    "model.language_model.layers.13.linear_attn.conv1d.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.13.linear_attn.dt_bias": "model-00009-of-00026.safetensors",
    "model.language_model.layers.13.linear_attn.in_proj_a.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.13.linear_attn.in_proj_b.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.13.linear_attn.in_proj_qkv.weight": "model-00008-of-00026.safetensors",
    "model.language_model.layers.13.linear_attn.in_proj_z.weight": "model-00008-of-00026.safetensors",
    "model.language_model.layers.13.linear_attn.norm.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.13.linear_attn.out_proj.weight": "model-00008-of-00026.safetensors",
    "model.language_model.layers.13.mlp.experts.down_proj": "model-00008-of-00026.safetensors",
    "model.language_model.layers.13.mlp.experts.gate_up_proj": "model-00008-of-00026.safetensors",
    "model.language_model.layers.13.mlp.gate.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.13.mlp.shared_expert.down_proj.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.13.mlp.shared_expert.gate_proj.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.13.mlp.shared_expert.up_proj.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.13.mlp.shared_expert_gate.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.13.post_attention_layernorm.weight": "model-00009-of-00026.safetensors",
    "model.language_model.layers.14.input_layernorm.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.14.linear_attn.A_log": "model-00011-of-00026.safetensors",
    "model.language_model.layers.14.linear_attn.conv1d.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.14.linear_attn.dt_bias": "model-00011-of-00026.safetensors",
    "model.language_model.layers.14.linear_attn.in_proj_a.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.14.linear_attn.in_proj_b.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.14.linear_attn.in_proj_qkv.weight": "model-00010-of-00026.safetensors",
    "model.language_model.layers.14.linear_attn.in_proj_z.weight": "model-00010-of-00026.safetensors",
    "model.language_model.layers.14.linear_attn.norm.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.14.linear_attn.out_proj.weight": "model-00010-of-00026.safetensors",
    "model.language_model.layers.14.mlp.experts.down_proj": "model-00010-of-00026.safetensors",
    "model.language_model.layers.14.mlp.experts.gate_up_proj": "model-00010-of-00026.safetensors",
    "model.language_model.layers.14.mlp.gate.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.14.mlp.shared_expert.down_proj.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.14.mlp.shared_expert.gate_proj.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.14.mlp.shared_expert.up_proj.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.14.mlp.shared_expert_gate.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.14.post_attention_layernorm.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.15.input_layernorm.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.15.mlp.experts.down_proj": "model-00011-of-00026.safetensors",
    "model.language_model.layers.15.mlp.experts.gate_up_proj": "model-00010-of-00026.safetensors",
    "model.language_model.layers.15.mlp.gate.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.15.mlp.shared_expert.down_proj.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.15.mlp.shared_expert.gate_proj.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.15.mlp.shared_expert.up_proj.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.15.mlp.shared_expert_gate.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.15.post_attention_layernorm.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.15.self_attn.k_norm.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.15.self_attn.k_proj.weight": "model-00010-of-00026.safetensors",
    "model.language_model.layers.15.self_attn.o_proj.weight": "model-00010-of-00026.safetensors",
    "model.language_model.layers.15.self_attn.q_norm.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.15.self_attn.q_proj.weight": "model-00010-of-00026.safetensors",
    "model.language_model.layers.15.self_attn.v_proj.weight": "model-00010-of-00026.safetensors",
    "model.language_model.layers.16.input_layernorm.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.16.linear_attn.A_log": "model-00011-of-00026.safetensors",
    "model.language_model.layers.16.linear_attn.conv1d.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.16.linear_attn.dt_bias": "model-00011-of-00026.safetensors",
    "model.language_model.layers.16.linear_attn.in_proj_a.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.16.linear_attn.in_proj_b.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.16.linear_attn.in_proj_qkv.weight": "model-00010-of-00026.safetensors",
    "model.language_model.layers.16.linear_attn.in_proj_z.weight": "model-00010-of-00026.safetensors",
    "model.language_model.layers.16.linear_attn.norm.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.16.linear_attn.out_proj.weight": "model-00010-of-00026.safetensors",
    "model.language_model.layers.16.mlp.experts.down_proj": "model-00011-of-00026.safetensors",
    "model.language_model.layers.16.mlp.experts.gate_up_proj": "model-00010-of-00026.safetensors",
    "model.language_model.layers.16.mlp.gate.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.16.mlp.shared_expert.down_proj.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.16.mlp.shared_expert.gate_proj.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.16.mlp.shared_expert.up_proj.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.16.mlp.shared_expert_gate.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.16.post_attention_layernorm.weight": "model-00011-of-00026.safetensors",
    "model.language_model.layers.17.input_layernorm.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.17.linear_attn.A_log": "model-00013-of-00026.safetensors",
    "model.language_model.layers.17.linear_attn.conv1d.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.17.linear_attn.dt_bias": "model-00013-of-00026.safetensors",
    "model.language_model.layers.17.linear_attn.in_proj_a.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.17.linear_attn.in_proj_b.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.17.linear_attn.in_proj_qkv.weight": "model-00012-of-00026.safetensors",
    "model.language_model.layers.17.linear_attn.in_proj_z.weight": "model-00012-of-00026.safetensors",
    "model.language_model.layers.17.linear_attn.norm.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.17.linear_attn.out_proj.weight": "model-00012-of-00026.safetensors",
    "model.language_model.layers.17.mlp.experts.down_proj": "model-00012-of-00026.safetensors",
    "model.language_model.layers.17.mlp.experts.gate_up_proj": "model-00012-of-00026.safetensors",
    "model.language_model.layers.17.mlp.gate.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.17.mlp.shared_expert.down_proj.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.17.mlp.shared_expert.gate_proj.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.17.mlp.shared_expert.up_proj.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.17.mlp.shared_expert_gate.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.17.post_attention_layernorm.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.18.input_layernorm.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.18.linear_attn.A_log": "model-00013-of-00026.safetensors",
    "model.language_model.layers.18.linear_attn.conv1d.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.18.linear_attn.dt_bias": "model-00013-of-00026.safetensors",
    "model.language_model.layers.18.linear_attn.in_proj_a.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.18.linear_attn.in_proj_b.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.18.linear_attn.in_proj_qkv.weight": "model-00012-of-00026.safetensors",
    "model.language_model.layers.18.linear_attn.in_proj_z.weight": "model-00012-of-00026.safetensors",
    "model.language_model.layers.18.linear_attn.norm.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.18.linear_attn.out_proj.weight": "model-00012-of-00026.safetensors",
    "model.language_model.layers.18.mlp.experts.down_proj": "model-00012-of-00026.safetensors",
    "model.language_model.layers.18.mlp.experts.gate_up_proj": "model-00013-of-00026.safetensors",
    "model.language_model.layers.18.mlp.gate.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.18.mlp.shared_expert.down_proj.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.18.mlp.shared_expert.gate_proj.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.18.mlp.shared_expert.up_proj.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.18.mlp.shared_expert_gate.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.18.post_attention_layernorm.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.19.input_layernorm.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.19.mlp.experts.down_proj": "model-00013-of-00026.safetensors",
    "model.language_model.layers.19.mlp.experts.gate_up_proj": "model-00012-of-00026.safetensors",
    "model.language_model.layers.19.mlp.gate.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.19.mlp.shared_expert.down_proj.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.19.mlp.shared_expert.gate_proj.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.19.mlp.shared_expert.up_proj.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.19.mlp.shared_expert_gate.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.19.post_attention_layernorm.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.19.self_attn.k_norm.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.19.self_attn.k_proj.weight": "model-00012-of-00026.safetensors",
    "model.language_model.layers.19.self_attn.o_proj.weight": "model-00012-of-00026.safetensors",
    "model.language_model.layers.19.self_attn.q_norm.weight": "model-00013-of-00026.safetensors",
    "model.language_model.layers.19.self_attn.q_proj.weight": "model-00012-of-00026.safetensors",
    "model.language_model.layers.19.self_attn.v_proj.weight": "model-00012-of-00026.safetensors",
    "model.language_model.layers.2.input_layernorm.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.linear_attn.A_log": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.linear_attn.conv1d.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.linear_attn.dt_bias": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.linear_attn.in_proj_a.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.linear_attn.in_proj_b.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.linear_attn.in_proj_qkv.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.linear_attn.in_proj_z.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.linear_attn.norm.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.linear_attn.out_proj.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.mlp.experts.down_proj": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.mlp.experts.gate_up_proj": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.mlp.gate.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.mlp.shared_expert.down_proj.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.mlp.shared_expert.gate_proj.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.mlp.shared_expert.up_proj.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.mlp.shared_expert_gate.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.2.post_attention_layernorm.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.20.input_layernorm.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.20.linear_attn.A_log": "model-00015-of-00026.safetensors",
    "model.language_model.layers.20.linear_attn.conv1d.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.20.linear_attn.dt_bias": "model-00015-of-00026.safetensors",
    "model.language_model.layers.20.linear_attn.in_proj_a.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.20.linear_attn.in_proj_b.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.20.linear_attn.in_proj_qkv.weight": "model-00014-of-00026.safetensors",
    "model.language_model.layers.20.linear_attn.in_proj_z.weight": "model-00014-of-00026.safetensors",
    "model.language_model.layers.20.linear_attn.norm.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.20.linear_attn.out_proj.weight": "model-00014-of-00026.safetensors",
    "model.language_model.layers.20.mlp.experts.down_proj": "model-00014-of-00026.safetensors",
    "model.language_model.layers.20.mlp.experts.gate_up_proj": "model-00014-of-00026.safetensors",
    "model.language_model.layers.20.mlp.gate.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.20.mlp.shared_expert.down_proj.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.20.mlp.shared_expert.gate_proj.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.20.mlp.shared_expert.up_proj.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.20.mlp.shared_expert_gate.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.20.post_attention_layernorm.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.21.input_layernorm.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.21.linear_attn.A_log": "model-00015-of-00026.safetensors",
    "model.language_model.layers.21.linear_attn.conv1d.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.21.linear_attn.dt_bias": "model-00015-of-00026.safetensors",
    "model.language_model.layers.21.linear_attn.in_proj_a.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.21.linear_attn.in_proj_b.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.21.linear_attn.in_proj_qkv.weight": "model-00014-of-00026.safetensors",
    "model.language_model.layers.21.linear_attn.in_proj_z.weight": "model-00014-of-00026.safetensors",
    "model.language_model.layers.21.linear_attn.norm.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.21.linear_attn.out_proj.weight": "model-00014-of-00026.safetensors",
    "model.language_model.layers.21.mlp.experts.down_proj": "model-00014-of-00026.safetensors",
    "model.language_model.layers.21.mlp.experts.gate_up_proj": "model-00015-of-00026.safetensors",
    "model.language_model.layers.21.mlp.gate.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.21.mlp.shared_expert.down_proj.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.21.mlp.shared_expert.gate_proj.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.21.mlp.shared_expert.up_proj.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.21.mlp.shared_expert_gate.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.21.post_attention_layernorm.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.22.input_layernorm.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.22.linear_attn.A_log": "model-00015-of-00026.safetensors",
    "model.language_model.layers.22.linear_attn.conv1d.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.22.linear_attn.dt_bias": "model-00015-of-00026.safetensors",
    "model.language_model.layers.22.linear_attn.in_proj_a.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.22.linear_attn.in_proj_b.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.22.linear_attn.in_proj_qkv.weight": "model-00014-of-00026.safetensors",
    "model.language_model.layers.22.linear_attn.in_proj_z.weight": "model-00014-of-00026.safetensors",
    "model.language_model.layers.22.linear_attn.norm.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.22.linear_attn.out_proj.weight": "model-00014-of-00026.safetensors",
    "model.language_model.layers.22.mlp.experts.down_proj": "model-00015-of-00026.safetensors",
    "model.language_model.layers.22.mlp.experts.gate_up_proj": "model-00014-of-00026.safetensors",
    "model.language_model.layers.22.mlp.gate.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.22.mlp.shared_expert.down_proj.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.22.mlp.shared_expert.gate_proj.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.22.mlp.shared_expert.up_proj.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.22.mlp.shared_expert_gate.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.22.post_attention_layernorm.weight": "model-00015-of-00026.safetensors",
    "model.language_model.layers.23.input_layernorm.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.23.mlp.experts.down_proj": "model-00016-of-00026.safetensors",
    "model.language_model.layers.23.mlp.experts.gate_up_proj": "model-00016-of-00026.safetensors",
    "model.language_model.layers.23.mlp.gate.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.23.mlp.shared_expert.down_proj.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.23.mlp.shared_expert.gate_proj.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.23.mlp.shared_expert.up_proj.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.23.mlp.shared_expert_gate.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.23.post_attention_layernorm.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.23.self_attn.k_norm.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.23.self_attn.k_proj.weight": "model-00016-of-00026.safetensors",
    "model.language_model.layers.23.self_attn.o_proj.weight": "model-00016-of-00026.safetensors",
    "model.language_model.layers.23.self_attn.q_norm.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.23.self_attn.q_proj.weight": "model-00016-of-00026.safetensors",
    "model.language_model.layers.23.self_attn.v_proj.weight": "model-00016-of-00026.safetensors",
    "model.language_model.layers.24.input_layernorm.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.24.linear_attn.A_log": "model-00017-of-00026.safetensors",
    "model.language_model.layers.24.linear_attn.conv1d.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.24.linear_attn.dt_bias": "model-00017-of-00026.safetensors",
    "model.language_model.layers.24.linear_attn.in_proj_a.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.24.linear_attn.in_proj_b.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.24.linear_attn.in_proj_qkv.weight": "model-00016-of-00026.safetensors",
    "model.language_model.layers.24.linear_attn.in_proj_z.weight": "model-00016-of-00026.safetensors",
    "model.language_model.layers.24.linear_attn.norm.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.24.linear_attn.out_proj.weight": "model-00016-of-00026.safetensors",
    "model.language_model.layers.24.mlp.experts.down_proj": "model-00016-of-00026.safetensors",
    "model.language_model.layers.24.mlp.experts.gate_up_proj": "model-00016-of-00026.safetensors",
    "model.language_model.layers.24.mlp.gate.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.24.mlp.shared_expert.down_proj.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.24.mlp.shared_expert.gate_proj.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.24.mlp.shared_expert.up_proj.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.24.mlp.shared_expert_gate.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.24.post_attention_layernorm.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.25.input_layernorm.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.25.linear_attn.A_log": "model-00017-of-00026.safetensors",
    "model.language_model.layers.25.linear_attn.conv1d.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.25.linear_attn.dt_bias": "model-00017-of-00026.safetensors",
    "model.language_model.layers.25.linear_attn.in_proj_a.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.25.linear_attn.in_proj_b.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.25.linear_attn.in_proj_qkv.weight": "model-00016-of-00026.safetensors",
    "model.language_model.layers.25.linear_attn.in_proj_z.weight": "model-00016-of-00026.safetensors",
    "model.language_model.layers.25.linear_attn.norm.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.25.linear_attn.out_proj.weight": "model-00016-of-00026.safetensors",
    "model.language_model.layers.25.mlp.experts.down_proj": "model-00016-of-00026.safetensors",
    "model.language_model.layers.25.mlp.experts.gate_up_proj": "model-00017-of-00026.safetensors",
    "model.language_model.layers.25.mlp.gate.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.25.mlp.shared_expert.down_proj.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.25.mlp.shared_expert.gate_proj.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.25.mlp.shared_expert.up_proj.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.25.mlp.shared_expert_gate.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.25.post_attention_layernorm.weight": "model-00017-of-00026.safetensors",
    "model.language_model.layers.26.input_layernorm.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.26.linear_attn.A_log": "model-00019-of-00026.safetensors",
    "model.language_model.layers.26.linear_attn.conv1d.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.26.linear_attn.dt_bias": "model-00019-of-00026.safetensors",
    "model.language_model.layers.26.linear_attn.in_proj_a.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.26.linear_attn.in_proj_b.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.26.linear_attn.in_proj_qkv.weight": "model-00018-of-00026.safetensors",
    "model.language_model.layers.26.linear_attn.in_proj_z.weight": "model-00018-of-00026.safetensors",
    "model.language_model.layers.26.linear_attn.norm.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.26.linear_attn.out_proj.weight": "model-00018-of-00026.safetensors",
    "model.language_model.layers.26.mlp.experts.down_proj": "model-00019-of-00026.safetensors",
    "model.language_model.layers.26.mlp.experts.gate_up_proj": "model-00018-of-00026.safetensors",
    "model.language_model.layers.26.mlp.gate.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.26.mlp.shared_expert.down_proj.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.26.mlp.shared_expert.gate_proj.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.26.mlp.shared_expert.up_proj.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.26.mlp.shared_expert_gate.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.26.post_attention_layernorm.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.27.input_layernorm.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.27.mlp.experts.down_proj": "model-00019-of-00026.safetensors",
    "model.language_model.layers.27.mlp.experts.gate_up_proj": "model-00018-of-00026.safetensors",
    "model.language_model.layers.27.mlp.gate.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.27.mlp.shared_expert.down_proj.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.27.mlp.shared_expert.gate_proj.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.27.mlp.shared_expert.up_proj.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.27.mlp.shared_expert_gate.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.27.post_attention_layernorm.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.27.self_attn.k_norm.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.27.self_attn.k_proj.weight": "model-00018-of-00026.safetensors",
    "model.language_model.layers.27.self_attn.o_proj.weight": "model-00018-of-00026.safetensors",
    "model.language_model.layers.27.self_attn.q_norm.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.27.self_attn.q_proj.weight": "model-00018-of-00026.safetensors",
    "model.language_model.layers.27.self_attn.v_proj.weight": "model-00018-of-00026.safetensors",
    "model.language_model.layers.28.input_layernorm.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.28.linear_attn.A_log": "model-00019-of-00026.safetensors",
    "model.language_model.layers.28.linear_attn.conv1d.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.28.linear_attn.dt_bias": "model-00019-of-00026.safetensors",
    "model.language_model.layers.28.linear_attn.in_proj_a.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.28.linear_attn.in_proj_b.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.28.linear_attn.in_proj_qkv.weight": "model-00018-of-00026.safetensors",
    "model.language_model.layers.28.linear_attn.in_proj_z.weight": "model-00018-of-00026.safetensors",
    "model.language_model.layers.28.linear_attn.norm.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.28.linear_attn.out_proj.weight": "model-00018-of-00026.safetensors",
    "model.language_model.layers.28.mlp.experts.down_proj": "model-00018-of-00026.safetensors",
    "model.language_model.layers.28.mlp.experts.gate_up_proj": "model-00018-of-00026.safetensors",
    "model.language_model.layers.28.mlp.gate.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.28.mlp.shared_expert.down_proj.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.28.mlp.shared_expert.gate_proj.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.28.mlp.shared_expert.up_proj.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.28.mlp.shared_expert_gate.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.28.post_attention_layernorm.weight": "model-00019-of-00026.safetensors",
    "model.language_model.layers.29.input_layernorm.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.29.linear_attn.A_log": "model-00021-of-00026.safetensors",
    "model.language_model.layers.29.linear_attn.conv1d.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.29.linear_attn.dt_bias": "model-00021-of-00026.safetensors",
    "model.language_model.layers.29.linear_attn.in_proj_a.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.29.linear_attn.in_proj_b.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.29.linear_attn.in_proj_qkv.weight": "model-00020-of-00026.safetensors",
    "model.language_model.layers.29.linear_attn.in_proj_z.weight": "model-00020-of-00026.safetensors",
    "model.language_model.layers.29.linear_attn.norm.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.29.linear_attn.out_proj.weight": "model-00020-of-00026.safetensors",
    "model.language_model.layers.29.mlp.experts.down_proj": "model-00020-of-00026.safetensors",
    "model.language_model.layers.29.mlp.experts.gate_up_proj": "model-00021-of-00026.safetensors",
    "model.language_model.layers.29.mlp.gate.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.29.mlp.shared_expert.down_proj.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.29.mlp.shared_expert.gate_proj.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.29.mlp.shared_expert.up_proj.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.29.mlp.shared_expert_gate.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.29.post_attention_layernorm.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.3.input_layernorm.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.3.mlp.experts.down_proj": "model-00003-of-00026.safetensors",
    "model.language_model.layers.3.mlp.experts.gate_up_proj": "model-00003-of-00026.safetensors",
    "model.language_model.layers.3.mlp.gate.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.3.mlp.shared_expert.down_proj.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.3.mlp.shared_expert.gate_proj.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.3.mlp.shared_expert.up_proj.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.3.mlp.shared_expert_gate.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.3.post_attention_layernorm.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.3.self_attn.k_norm.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.3.self_attn.k_proj.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.3.self_attn.o_proj.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.3.self_attn.q_norm.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.3.self_attn.q_proj.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.3.self_attn.v_proj.weight": "model-00003-of-00026.safetensors",
    "model.language_model.layers.30.input_layernorm.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.30.linear_attn.A_log": "model-00021-of-00026.safetensors",
    "model.language_model.layers.30.linear_attn.conv1d.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.30.linear_attn.dt_bias": "model-00021-of-00026.safetensors",
    "model.language_model.layers.30.linear_attn.in_proj_a.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.30.linear_attn.in_proj_b.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.30.linear_attn.in_proj_qkv.weight": "model-00020-of-00026.safetensors",
    "model.language_model.layers.30.linear_attn.in_proj_z.weight": "model-00020-of-00026.safetensors",
    "model.language_model.layers.30.linear_attn.norm.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.30.linear_attn.out_proj.weight": "model-00020-of-00026.safetensors",
    "model.language_model.layers.30.mlp.experts.down_proj": "model-00021-of-00026.safetensors",
    "model.language_model.layers.30.mlp.experts.gate_up_proj": "model-00020-of-00026.safetensors",
    "model.language_model.layers.30.mlp.gate.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.30.mlp.shared_expert.down_proj.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.30.mlp.shared_expert.gate_proj.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.30.mlp.shared_expert.up_proj.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.30.mlp.shared_expert_gate.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.30.post_attention_layernorm.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.31.input_layernorm.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.31.mlp.experts.down_proj": "model-00020-of-00026.safetensors",
    "model.language_model.layers.31.mlp.experts.gate_up_proj": "model-00020-of-00026.safetensors",
    "model.language_model.layers.31.mlp.gate.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.31.mlp.shared_expert.down_proj.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.31.mlp.shared_expert.gate_proj.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.31.mlp.shared_expert.up_proj.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.31.mlp.shared_expert_gate.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.31.post_attention_layernorm.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.31.self_attn.k_norm.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.31.self_attn.k_proj.weight": "model-00020-of-00026.safetensors",
    "model.language_model.layers.31.self_attn.o_proj.weight": "model-00020-of-00026.safetensors",
    "model.language_model.layers.31.self_attn.q_norm.weight": "model-00021-of-00026.safetensors",
    "model.language_model.layers.31.self_attn.q_proj.weight": "model-00020-of-00026.safetensors",
    "model.language_model.layers.31.self_attn.v_proj.weight": "model-00020-of-00026.safetensors",
    "model.language_model.layers.32.input_layernorm.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.linear_attn.A_log": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.linear_attn.conv1d.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.linear_attn.dt_bias": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.linear_attn.in_proj_a.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.linear_attn.in_proj_b.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.linear_attn.in_proj_qkv.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.linear_attn.in_proj_z.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.linear_attn.norm.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.linear_attn.out_proj.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.mlp.experts.down_proj": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.mlp.experts.gate_up_proj": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.mlp.gate.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.mlp.shared_expert.down_proj.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.mlp.shared_expert.gate_proj.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.mlp.shared_expert.up_proj.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.mlp.shared_expert_gate.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.32.post_attention_layernorm.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.input_layernorm.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.linear_attn.A_log": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.linear_attn.conv1d.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.linear_attn.dt_bias": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.linear_attn.in_proj_a.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.linear_attn.in_proj_b.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.linear_attn.in_proj_qkv.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.linear_attn.in_proj_z.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.linear_attn.norm.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.linear_attn.out_proj.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.mlp.experts.down_proj": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.mlp.experts.gate_up_proj": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.mlp.gate.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.mlp.shared_expert.down_proj.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.mlp.shared_expert.gate_proj.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.mlp.shared_expert.up_proj.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.mlp.shared_expert_gate.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.33.post_attention_layernorm.weight": "model-00022-of-00026.safetensors",
    "model.language_model.layers.34.input_layernorm.weight": "model-00023-of-00026.safetensors",
    "model.language_model.layers.34.linear_attn.A_log": "model-00023-of-00026.safetensors",
    "model.language_model.layers.34.linear_attn.conv1d.weight": "model-00023-of-00026.safetensors",
    "model.language_model.layers.34.linear_attn.dt_bias": "model-00023-of-00026.safetensors",
    "model.language_model.layers.34.linear_attn.in_proj_a.weight": "model-00023-of-00026.safetensors",
    "model.language_model.layers.34.linear_attn.in_proj_b.weight": "model-00023-of-00026.safetensors",
    "model.language_model.layers.34.linear_attn.in_proj_qkv.weight": "model-00023-of-00026.safetensors",
    "model.language_model.layers.34.linear_attn.in_proj_z.weight": "model-00023-of-00026.safetensors",
    "model.language_model.layers.34.linear_attn.norm.weight": "model-00023-of-00026.safetensors",
    "model.language_model.layers.34.linear_attn.out_proj.weight": "model-00023-of-00026.safetensors",
    "model.language_model.layers.34.mlp.experts.down_proj": "model-00023-of-00026.safetensors",
